///Константы задающие фракталы
unit PaporotnikData;

uses Paporotnik;

var
  ///Папоротник с изогнутым листом
  PaprotnikData: PaporotnikFractalInitalData := (
    data: (( 0.0000,  0.0000,  0.0000,  0.1600, 0, 0.0000),
	         ( 0.8500,  0.0400, -0.0400,  0.8500, 0, 1.6000),
	         ( 0.1667, -0.2887,  0.2887,  0.1667, 0, 1.6000),
	         (-0.1667,  0.2887,  0.2887,  0.1667, 0, 0.4400));
    P0: 3; 
    P1: 83;
    P2: 7; 
    P3: 7);
    
  ///Папоротник с прямым листом
  SimplePaprotnikData: PaporotnikFractalInitalData := (
    data: (( 0.00,  0.00, 0.00, 0.16, 0, 0.00),
        	 ( 0.85,  0.00, 0.00, 0.85, 0, 1.60),
        	 ( 0.20, -0.26, 0.23, 0.22, 0, 1.60),
	         (-0.20,  0.26, 0.23, 0.22, 0, 1.60));
    P0: 3; 
    P1: 83;
    P2: 7; 
    P3: 7);

  ///Елка
  ElkaData: PaporotnikFractalInitalData := (
	  data: (( 0.1000,  0.0000,  0.0000,  0.1600, 0, 0.0000),
           ( 0.8500,  0.0000,  0.0000,  0.8500, 0, 1.6000),
           (-0.1667, -0.2887,  0.2887, -0.1667, 0, 1.6000),
           (-0.1667,  0.2887, -0.2887, -0.1667, 0, 1.6000));
    P0: 1; 
    P1: 85;
    P2: 7; 
    P3: 7);


end.