// Простейшие новые возможности языка PascalABC.NET

// Инициализация переменной при описании 
var i: integer := 1; 

// Автоопределение типа переменной при инициализации
var r := 2.5;

begin
  // Внутриблочные описания переменных
  var s: real := 1.0;
  
  // Описание переменной в заголовке цикла (время жизни переменной - до конца тела цикла)
  for j: integer := 1 to 10 do
    s += j; // Операция += для чисел

  var p := 1;
  
  // Описание переменной в заголовке цикла с автоопределением типа
  for var j := 1 to 10 do
    p *= j; // Операция *=
    
  var str := '';
  for c: char := 'a' to 'z' do
    str += c; // Операция += для строк
  
end.