{ Тема. Массивы. Заполнение следующего элемента по предыдущему
  
  Задание. Заполните массив из 10 целых значениями
    5 10 15 20 25 ... 
  с использованием лямбда-выражения 
    x -> x + 5
  показывающего, что если предыдущий элемент равен x, то следующий элемент равен x + 5
  
  Указание. Используйте вызов ArrGen(10,5,x -> x + 5)
    Здесь 10 - количество элементов, 
          5 - первый элемент,
          x -> x + 5 - лямбда-функция, определяющая, как следующий элемент вычисляется по предыдущему   
}  

begin 
    
end.
