uses Исполнители;

begin
  {Файл.Записать('неверно');
  Вывод.ПустаяСтрока;}
  
  {Файл.ОткрытьНаЗапись('текст.txt');
  Файл.Записать('Информатика');
  Файл.Записать('Математика');
  Файл.Записать('Русский');
  Файл.Записать('Физика');
  Файл.Записать('Русский');
  Файл.Записать('Информатика');
  Файл.Закрыть;
  
  Файл.ВывестиСодержимое('текст.txt');
  Вывод.ПустаяСтрока;
  Файл.ВывестиСодержимое('Пример2');
  Вывод.ПустаяСтрока;
  Файл.ВывестиСодержимое('Пример2.pas');
  Вывод.ПустаяСтрока;
  
  var Файл1 := Файл.Новый;
  var Файл2 := Файл.Новый;
  Файл1.ОткрытьНаЧтение('текст.txt');
  Файл2.ОткрытьНаЗапись('текст2.txt');
  while not Файл1.КонецФайла do
  begin
    var строка := Файл1.ПрочитатьСтроку;
    Файл2.Записать(строка);
  end;
  Файл1.Закрыть;
  Файл2.Закрыть;}
  
  var строки := Файл.ВсеСтроки('текст.txt');
  строки.ВывестиПострочно;
  
  Вывод.ПустаяСтрока;
  foreach var строка in строки do
    МножествоСтрок.Добавить(строка);
    
  МножествоСтрок.Вывести;
  
  {Файл.ВсеСтроки('текст.txt').Numerate.ВывестиПострочно;
  
  МножествоСтрок.Очистить;
  Файл.ВсеСтроки('текст.txt').ДляВсех(стр -> МножествоСтрок.Добавить(стр));
  МножествоСтрок.Вывести;
  
  
  Файл.ВывестиВсеМетоды;}
end.  
  