{ 
Изменений в языке при переходе к версии 4.0 нет

Основные изменения:
1. Компилятор под .NET 10, открывающий возможности использования многочисленных новых библиотек .NET 10
2. Расширение PascalABC.NET для VS Code, использующее target .NET 10, которое можно использовать под Linux.
   Подсветка синтаксиса, компиляция и запуск программ, подсветка ошибок, Intellisense
3. Библиотека ML PascalABC.NET полностью без внешних зависимостей. 
   Встроенные русские датасеты. Примеры - в Samples/MachineLearning   

}